starter-kit-publish.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Publish</title>
<!-- 2014-10-13 Mon 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Publish</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<p>
This file is used to publish the starter kit documentation to <code>.html</code>
in the <code>doc/</code> directory.
</p>

<p>
This code defines the <code>starter-kit-project</code> which is used to publish
the documentation for the Starter Kit to html.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">unless</span> (boundp 'org-publish-project-alist)
  (setq org-publish-project-alist nil))

(<span style="font-weight: bold;">let*</span> ((this-dir (file-name-directory (or load-file-name buffer-file-name)))
       (starter-kit-dir this-dir)
      (org-export-htmlize-output-type 'css)
      (load-path (cons (expand-file-name <span style="font-style: italic;">"elpa"</span> this-dir) load-path))
      (package-archives '((<span style="font-style: italic;">"original"</span>    . <span style="font-style: italic;">"http://tromey.com/elpa/"</span>))))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">load the basic starter kit</span>
  (org-babel-load-file (expand-file-name <span style="font-style: italic;">"starter-kit.org"</span> this-dir))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">load up htmlize</span>
  (package-initialize)
  (<span style="font-weight: bold;">unless</span> (functionp 'htmlize)
    (starter-kit-install-if-needed 'htmlize))
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">htmlize</span>)
  (org-html-htmlize-generate-css)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">define the org-publish-project for the starter kit</span>
  (add-to-list
   'org-publish-project-alist
   `(<span style="font-style: italic;">"starter-kit-documentation"</span>
     <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
     <span style="font-weight: bold;">:base-directory</span> ,this-dir
     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
     <span style="font-weight: bold;">:style</span> <span style="font-style: italic;">"&lt;link rel=\"stylesheet\" href=\"emacs.css\" type=\"text/css\"/&gt;</span>
<span style="font-style: italic;">&lt;style type=\"text/css\"&gt;</span>
<span style="font-style: italic;">  pre{background:#232323; color:#E6E1DC;}</span>
<span style="font-style: italic;">  code{font-size:10pt; color:#353535;}</span>
<span style="font-style: italic;">  .outline-text-2{margin-left: 1em;}</span>
<span style="font-style: italic;">  .outline-text-3{margin-left: 2em;}</span>
<span style="font-style: italic;">  .outline-text-3{margin-left: 3em;}</span>
<span style="font-style: italic;">&lt;/style&gt;"</span>
     <span style="font-weight: bold;">:publishing-directory</span> ,(expand-file-name <span style="font-style: italic;">"doc"</span> this-dir)
     <span style="font-weight: bold;">:index-filename</span> <span style="font-style: italic;">"starter-kit.org"</span>
     <span style="font-weight: bold;">:html-postamble</span> nil))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">publish the starter kit</span>
  (org-publish-project <span style="font-style: italic;">"starter-kit-documentation"</span> 'force)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">copy starter-kit.html to index.html</span>
  (copy-file (expand-file-name <span style="font-style: italic;">"starter-kit.html"</span> (expand-file-name <span style="font-style: italic;">"doc"</span> this-dir))
             (expand-file-name <span style="font-style: italic;">"index.html"</span> (expand-file-name <span style="font-style: italic;">"doc"</span> this-dir)) t))
</pre>
</div>
</div>
</body>
</html>
